W11D1/TodosApp/TodosApp/app/controllers/api/todos_controller.rb

  def update
    @todo = Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 1]]