W6D2/Art_Share_API/app/controllers/artworks_controller.rb

    def index
        render json: Artwork.all
---
SELECT "artworks".* FROM "artworks"

    def update
        artwork = Artwork.find(params[:id])

        if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Clay Sculpture"], ["updated_at", "2020-12-30 22:30:30.653844"], ["id", 1]]