W6D2/Art_Share_API/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (users.username like username=Trevor)
SELECT "users".* FROM "users" WHERE (users.username like Trevor)
---
    def index
        debugger
        if request.query_string.present?
            user = User.where("users.username like #{request.query_string.split('=')}")
            render json: user
        else
             render json: User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Trevor"], ["updated_at", "2020-12-31 00:42:17.164790"], ["id", 7]]
---
    def update
        debugger
        user = User.find(params[:id])

        if user.update(user_params)